/*
Practice:


Необхідно спроектувати БД поставки товарів
В БД має зберігатися наступна інформація:

ТОВАРИ:
- код товара, назва, ціна

ЗАМОВЛЕННЯ на поставку:
- код замовлення
- наименування постачальника, 
- адреса постачальника,
- телефон 
- номер договору
- дата заключення договору
- наіменування товару
- план поставки (кількість в шт.)

Фактичні відгрузки товару:
- код відгрузки
- код замовлення
- дата відгрузки
- відгружено товару (шт)

При проектуванні БД необхідно врахувати:
- товар має декілька замовлень на постачання.
- Замовлення відповідає одному товару
- товару можуть відповідати декілька відгрузок
- у одній вігрузці може бути декілька товарів

- товар не обов'язково має замовлення. Кожне замовлення відповідає товару
- товар не обов'язково відгружається замовнику, але кожна вігрузка обов'язково відповідає певному товару.

*/
